<?xml version="1.0" encoding="utf-8"?>
<content type="article" id="113">
  <title>3. Performant</title>
  <description>&lt;p&gt;Toutes les solutions des gestion de contenus actuelles reposent sur des bases de donn&amp;eacute;es dites &amp;quot;relationnelles&amp;quot;, telles que MySQL pour ne citer que la plus r&amp;eacute;pandue. Si elles pr&amp;eacute;sentent un mod&amp;egrave;le &amp;eacute;prouv&amp;eacute; et mature, ces bases n&amp;#39;ont pas &amp;eacute;t&amp;eacute; pens&amp;eacute;es pour g&amp;eacute;rer correctement les grands volumes de donn&amp;eacute;es et la fr&amp;eacute;quentation exponentielle du Web. Les plus grands m&amp;eacute;dia pr&amp;eacute;sents sur le web, tels que Google, Facebook, Amazon, ou LinkedIn ont donc &amp;eacute;t&amp;eacute; contraints de d&amp;eacute;velopper leurs propres syst&amp;egrave;mes, pens&amp;eacute;s pour &amp;ecirc;tre facilement r&amp;eacute;partis sur de multiples machines, et une nouvelle g&amp;eacute;n&amp;eacute;ration de bases qualifi&amp;eacute;es de &lt;strong&gt;noSQL&lt;/strong&gt; ou de &lt;strong&gt;Bases Documentaires&lt;/strong&gt;, plus flexibles, plus performantes et plus adapt&amp;eacute;es &amp;agrave; la gestion de contenus web, a vu le jour.&lt;/p&gt;

&lt;blockquote&gt;&lt;strong&gt;&lt;span class="label label-info"&gt;Rubedo&lt;/span&gt; est le premier CMS Documentaire du march&amp;eacute;&lt;/strong&gt;, ce qui en fait une solution particuli&amp;egrave;rement adapt&amp;eacute;e pour les sites &amp;agrave; forte fr&amp;eacute;quentation g&amp;eacute;rant de grandes volumes de donn&amp;eacute;es, m&amp;ecirc;me si vous pouvez aussi g&amp;eacute;rer votre site perso.&lt;/blockquote&gt;
</description>
  <lang>fr</lang>
  <status>valid</status>
  <version>1</version>
  <dcreat/>
  <authorcreat/>
  <dmod/>
  <authormod/>
  <dpub>2012-08-27</dpub>
  <deopub/>
  <author>Julien Bourdin</author>
  <taxonomy/>
  <subtitle>Performance</subtitle>
  <paragraph>&lt;p&gt;Toutes les solutions des gestion de contenus actuelles reposent sur des bases de données dites "relationnelles", telles que MySQL pour ne citer que la plus répandue. Si elles présentent un modèle éprouvé et mature, ces bases n'ont pas été pensées pour gérer correctement les grands volumes de données et la fréquentation exponentielle du Web. Les plus grands média présents sur le web, tels que Google, Facebook, Amazon, ou LinkedIn ont donc été contraints de développer leurs propres systèmes, pensés pour être facilement répartis sur de multiples machines, et une nouvelle génération de bases qualifiées de &lt;strong&gt;noSQL&lt;/strong&gt; ou de &lt;strong&gt;Bases Documentaires&lt;/strong&gt;, plus flexibles, plus performantes et plus adaptées à la gestion de contenus web, a vu le jour.&lt;/p&gt;

&lt;blockquote&gt;&lt;strong&gt;&lt;span class="label label-info"&gt;Rubedo&lt;/span&gt; est le premier CMS Documentaire du marché&lt;/strong&gt;, ce qui en fait une solution particulièrement adaptée pour les sites à forte fréquentation gérant de grandes volumes de données, même si vous pouvez aussi gérer votre site perso.&lt;/blockquote&gt;
</paragraph>
  <link>&lt;p&gt;&lt;a class="btn" href="/index/performant"&gt;Focus sur l&amp;#39;architecture &amp;raquo;&lt;/a&gt;&lt;/p&gt;</link>
  <attachment>data/fr/rubedo_fr.pdf</attachment>
  <canonical_url/>
</content>
